schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
void slcanHandleCommand(const char* cmd) {
    switch (cmd[0]) {
        case 'O': slcan_open = true;  Serial.write('\r'); break;
        case 'C': slcan_open = false; Serial.write('\r'); break;
        case 'S': Serial.write('\r'); break;   // speed — fixed at 250k
        case 'V': Serial.print("V1013\r"); break;
        case 'N': Serial.print("NA000\r"); break;
        case 'F': Serial.print("F00\r");   break;
        default:  Serial.write('\r'); break;
    }
}

void slcanPoll() {
    while (Serial.available()) {
        char c = Serial.read();
        if (c == '\r' || c == '\n') {
            if (slcan_len > 0) {
                slcan_buf[slcan_len] = '\0';
                slcanHandleCommand(slcan_buf);
                slcan_len = 0;
            }
        } else if (slcan_len < sizeof(slcan_buf) - 1) {
            slcan_buf[slcan_len++] = c;
        }
    }
}

// ── socketcand ────────────────────────────────────────────────────────────────
// Streams raw CAN frames over WiFi using the socketcand ASCII protocol.
// python-can: interface='socketcand', host='tractor.local', port=28600,
//             channel='can0'
//
// One slot per channel — a client picks its bus with `< open canN >`. On the
// T-2CAN both buses are streamed (can0 = TWAI, can1 = MCP2515); on the
// Feather only can0 is available. Two clients can be connected at once on the
// T-2CAN, one per channel. A new connection that arrives while every slot is
// taken is rejected (the existing clients are kept).

#define SOCKETCAND_PORT 28600
// A client that connects but never completes the open/rawmode handshake would
// pin its slot forever; reclaim the slot after this long.
#define SOCKETCAND_HANDSHAKE_MS 10000

#if defined(HAS_MCP2515)
  #define SOCKETCAND_NUM_CHANNELS 2
#else
  #define SOCKETCAND_NUM_CHANNELS 1
#endif

enum SocketcandState {
    SC_DISCONNECTED,
    SC_WAITING_OPEN,
    SC_WAITING_RAWMODE,
    SC_RAWMODE,
};

struct SocketcandSlot {
    WiFiClient      client;
    SocketcandState state   = SC_DISCONNECTED;
    char            buf[64];
    uint8_t         len     = 0;
    int8_t          channel = -1;   // set when `< open canN >` is parsed
    uint32_t        opened_ms = 0;  // millis() when the TCP connection arrived
};

static WiFiServer     socketcand_server(SOCKETCAND_PORT);
static SocketcandSlot socketcand_slots[SOCKETCAND_NUM_CHANNELS];

static void socketcandCloseSlot(SocketcandSlot& slot) {
    slot.client.stop();
    slot.state   = SC_DISCONNECTED;
    slot.len     = 0;
    slot.channel = -1;
}

// True if the client's socket can take a write right now. WiFiClient::write
// has no non-blocking form — on a stalled client (phone out of range, no FIN)
// it select()s up to 1 s per call, which would stall CAN RX and every other
// service behind one dead peer. lwIP reports a socket writable only when at
// least TCP_SNDLOWAT (~half the send buffer) is free, so a whole frame line
// always fits once this returns true.
static bool socketcandWritable(WiFiClient& client) {
    int fd = client.fd();
    if (fd < 0) return false;
    fd_set wset;
    FD_ZERO(&wset);
    FD_SET(fd, &wset);
    struct timeval tv = {0, 0};
    return select(fd + 1, nullptr, &wset, nullptr, &tv) > 0;
}

#if defined(HAS_MCP2515)
// MCP2515: external classic-CAN 2.0B controller wired to SPI, run at 250 kbit/s
// to match the J1939 main bus. The library's RX buffers are drained from
// loop(); frames are forwarded to socketcand as channel can1. Crystal frequency
// is board-dependent — see MCP2515_QUARTZ_HZ if can1 stays silent.
static ACAN2515 g_mcp(MCP2515_CS_PIN, SPI, MCP2515_INT_PIN);
#endif

void socketcandSendFrame(const twai_message_t& msg, int8_t channel) {
    uint32_t now_ms = millis();
    uint32_t secs   = now_ms / 1000;
    uint32_t usecs  = (now_ms % 1000) * 1000;
    // EFF flag (bit 31) marks the ID as 29-bit extended — python-can expects this.
    uint32_t id_wire = msg.identifier | (msg.extd ? 0x80000000UL : 0);
    char line[80];
    int n = snprintf(line, sizeof(line), "< frame %lX %lu.%06lu ",
                     (unsigned long)id_wire,
                     (unsigned long)secs, (unsigned long)usecs);
    for (int i = 0; i < msg.data_length_code && n < (int)sizeof(line) - 4; i++)
        n += snprintf(line + n, sizeof(line) - n, "%02X", msg.data[i]);
    n += snprintf(line + n, sizeof(line) - n, " >");
    for (auto& slot : socketcand_slots) {
        if (slot.state == SC_RAWMODE && slot.channel == channel) {
            if (socketcandWritable(slot.client))
                slot.client.write((const uint8_t*)line, n);
            else
                g_socketcand_tx_dropped++;
        }
    }
}

// Parse "< send <idhex> <dlc> <b0> <b1> ... >" (rawmode TX) and inject the frame
// onto this slot's CAN controller. We accept both extended-ID encodings seen in
// the wild: standard socketcand/python-can distinguishes 29-bit frames purely by
// id-field width (3 hex chars => 11-bit, otherwise extended, no flag bit), while
// some clients also OR the EFF flag into bit 31 — either marks the frame
// extended here. Byte tokens may be 1 or 2 hex digits; the dlc (0..8) reads the
// same in decimal or hex. Anything unparseable is dropped, like a real daemon.
static void socketcandHandleSend(SocketcandSlot& slot, const char* cmd) {
    const char* p = cmd + 7;            // past "< send "
    char* end = nullptr;
    unsigned long id_val = strtoul(p, &end, 16);
    if (end == p) return;
    int id_len = (int)(end - p);
    p = end;
    long dlc = strtol(p, &end, 16);
    if (end == p || dlc < 0 || dlc > 8) return;
    p = end;
    uint8_t data[8] = {0};
    int got = 0;
    while (got < dlc) {
        long b = strtol(p, &end, 16);
        if (end == p) break;            // fewer tokens than dlc — leave zero-padded
        data[got++] = (uint8_t)(b & 0xFF);
        p = end;
    }
    bool extended = (id_val & 0x80000000UL) != 0 || id_len > 3;
    uint32_t id = extended ? (id_val & 0x1FFFFFFFUL) : (id_val & 0x7FFUL);

    if (slot.channel == 0) {
        twai_message_t tx = {};
        tx.identifier       = id;
        tx.extd             = extended ? 1 : 0;
        tx.data_length_code = (uint8_t)dlc;
        memcpy(tx.data, data, (size_t)dlc);
        twai_transmit(&tx, pdMS_TO_TICKS(10));
    }
#if defined(HAS_MCP2515)
    else if (slot.channel == 1 && g_mcp_initialized) {
        CANMessage tx;
        tx.id  = id;
        tx.ext = extended;
        tx.rtr = false;
        tx.len = (uint8_t)dlc;
        memcpy(tx.data, data, (size_t)dlc);
        g_mcp.tryToSend(tx);
    }
#endif
}

static void socketcandHandleCommand(SocketcandSlot& slot, const char* cmd) {
    if (slot.state == SC_WAITING_OPEN && strncmp(cmd, "< open ", 7) == 0) {
        // Parse "< open canN >": after "< open " expect "canN" then space-or-'>'.
        const char* arg = cmd + 7;
        if (strncmp(arg, "can", 3) == 0 && arg[3] >= '0' && arg[3] <= '9'
                && (arg[4] == ' ' || arg[4] == '>')) {
            int ch = arg[3] - '0';
            if (ch < SOCKETCAND_NUM_CHANNELS) {
                slot.channel = (int8_t)ch;
                slot.state   = SC_WAITING_RAWMODE;
                slot.client.print("< ok >");
                return;
            }
        }
        slot.client.print("< error >");
    } else if (slot.state == SC_WAITING_RAWMODE && strcmp(cmd, "< rawmode >") == 0) {
        slot.client.print("< ok >");
        slot.state = SC_RAWMODE;
    } else if (slot.state == SC_RAWMODE && strncmp(cmd, "< send ", 7) == 0) {
        socketcandHandleSend(slot, cmd);
    }
    // bcmmode/isotpmode/echo/statistics are intentionally unsupported.
}

